In [10]:
import pandas as pd
import numpy as np

In [11]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                                'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                                'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                                'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [12]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [13]:
for i in range(df.shape[0]):
    if df.iloc[i,1] == float(np.nan):
        print(1)

Question 1

In [14]:
df['FlightNumber'].fillna(value=0,inplace=True,downcast='int64')

In [15]:
for i in range(df.shape[0]):
    if df.iloc[i,1] == 0:
        df.iloc[i,1] = df.iloc[i-1,1] + 10

In [16]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

Question 2

In [17]:
df1 = pd.DataFrame(df['From_To'])

In [18]:
df1['From'] = 'From'
df1['To'] = 'To'

In [19]:
df1

            From_To  From  To
0      LoNDon_paris  From  To
1      MAdrid_miLAN  From  To
2  londON_StockhOlm  From  To
3    Budapest_PaRis  From  To
4   Brussels_londOn  From  To

In [20]:
for i in range(df1.shape[0]):
    df1.iloc[i,1],df1.iloc[i,2] = df1.iloc[i,0].split('_')
df1.drop('From_To',axis=1,inplace=True)

In [21]:
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

Question 3

In [22]:
for i in range(df1.shape[0]):
    df1.iloc[i,0] = df1.iloc[i,0].capitalize()
    df1.iloc[i,1] = df1.iloc[i,1].capitalize()

In [23]:
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

Question 4

In [24]:
df.drop('From_To',axis=1,inplace=True)

In [25]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [26]:
df_updated = pd.concat([df,df1],axis=1)

In [27]:
df_updated

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

Question 5

In [56]:
df_delay = pd.DataFrame(df_updated['RecentDelays'])

In [57]:
df_delay

   RecentDelays
0      [23, 47]
1            []
2  [24, 43, 87]
3          [13]
4      [67, 32]

In [58]:
df_temp = df_delay['RecentDelays'].apply(pd.Series)
df_temp.columns = ['delay_'+str(i+1) for i in range(len(df_temp.columns))]

In [59]:
df_temp

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [60]:
df = pd.concat([df_updated,df_temp],axis=1)

In [61]:
df.drop('RecentDelays',axis=1,inplace=True)

In [62]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN